/* Задача 25: Напишите цикл, который принимает на вход 
два числа (A и B) и возводит число A в натуральную степень B.
3, 5 -> 243 (3⁵)
2, 4 -> 16

 */
 

// int a = InputNumber("Введите число А");
// int b = InputNumber("Введите число B");    
// int result = resAxB(a, b);
//  Console.WriteLine(result);

// int InputNumber(string message) 
// {
//     Console.WriteLine(message);
//     int value = int.Parse(Console.ReadLine());
//     return value; 
// }

// int resAxB(int a, int b)
// {
// int count = 1;

// for (int i = 0; i < b; i++)
//     {
//         count = count * a; //count *= a;  
//     }
// return count;

// }





